src/Documents/инкОтпускРасчетПоСреднему/инкОтпускРасчетПоСреднему.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкОтпускРасчетПоСреднему</name>
  <registerRecords>InformationRegister.инкРеестрОтпусков</registerRecords>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.инкВидРасчетаОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаДниЧасы</name>
    <type>
      <types>EnumRef.инкВидРасчетаДниЧасы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьГодовуюПремиюЗаПредыдущийГод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсацияЗаНеиспользованныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетныеДанные</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДниЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДниЧасыФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректировкаДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректировкаДниРасчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииКвартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зарплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышениеЗПКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышениеЗПСуммаИндексации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатРасчета</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/инкНачисления/инкНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>инкНачисления</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДетей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БольничныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Взносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВычетНДФЛ</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкНачислениеЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.инкДоходНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериальнаяПомощь</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ст9ФЗ212</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФондТравматизма</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/инкВидРасчетаОтпуска/инкВидРасчетаОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидРасчетаОтпуска</name>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднему</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкВидыПремий/инкВидыПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидыПремий</name>
  <enumValues>
    <name>Годовая</name>
  </enumValues>
  <enumValues>
    <name>Квартальная</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкВидРасчетаДниЧасы/инкВидРасчетаДниЧасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидРасчетаДниЧасы</name>
  <enumValues>
    <name>ВДнях</name>
  </enumValues>
  <enumValues>
    <name>ВЧасах</name>
  </enumValues>
</mdclass:Enum>

src/Documents/инкОтпускРасчетПоСреднему/Forms/ФормаДокумента/Module.bsl
#Область о // Стандартные процедуры и функции:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ПервоначальноеЗаполнениеНаСервере(Отказ, Параметры);

КонецПроцедуры       

&НаСервере
Процедура ПервоначальноеЗаполнениеНаСервере(Отказ, Параметры)
	
	ЗаполнитьРеквизитИзПараметров("Организация",Параметры);
	ЗаполнитьРеквизитИзПараметров("Подразделение",Параметры);
	ЗаполнитьРеквизитИзПараметров("Сотрудник",Параметры);
	ЗаполнитьРеквизитИзПараметров("ВидРасчетаДниЧасы",Параметры);

	ЗаполнитьРеквизитИзПараметров("МесяцНачисления",Параметры);
	мМесяцНачисленияСтрокой  = инкЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(Объект.МесяцНачисления);
	
	УстановитьВидимостьКолонокПриСменеВидаРасчета();
	
	инкОбщийСервер.ЗадатьЗначениеПоУмолчанию("ВидНачисления",ПланыВидовРасчета.инкНачисления.ОплатаОчередныхОтпусков,Объект);
	инкОбщийСервер.ЗадатьЗначениеПоУмолчанию("ВидРасчета",Перечисления.инкВидРасчетаОтпуска.Отпуск,Объект);
	
	инкОбщийСервер.ЗадатьЗначениеПоУмолчанию("ПериодС",ТекущаяДата(),Объект);
	инкОбщийСервер.ЗадатьЗначениеПоУмолчанию("ПериодПО",ТекущаяДата(),Объект);
	ЗаполнитьДниОтпуска();
	                  
	ЗаполнитьРасчетныеДанныеНаСервере();
    ВидРасчетаОтпускаПриИзмененииНаСервере();
	
	ЭтаФорма.Заголовок = "Отпуск: "+Объект.Сотрудник.ФИОСокращенное;
	
КонецПроцедуры        

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если мПомещатьРасчетВХранилище Тогда
		Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());
	Иначе
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтпускСПриИзменении(Элемент)                           
	
	ЗаполнитьДниОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускПОПриИзменении(Элемент)
	
	ЗаполнитьДниОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтпускаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	РасчитатьОтпускНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораНачислений(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
    Объект.ВидНачисления = Значение; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПереченьКодовНачисленийДляОтпуска()
	
	ПереченьКодов = Новый Массив;
	
	Если Объект.ВидРасчета = Перечисления.инкВидРасчетаОтпуска.ПоСреднему Тогда
		ПереченьКодов.Добавить(ПланыВидовРасчета.инкНачисления.ОплатаПоСреднемуЗаработку.Код);
	Иначе
		ПереченьКодов.Добавить(ПланыВидовРасчета.инкНачисления.ОплатаОчередныхОтпусков.Код);
		ПереченьКодов.Добавить(ПланыВидовРасчета.инкНачисления.КомпенсацияЗаНеиспользованныйОтпуск.Код);
		ПереченьКодов.Добавить(ПланыВидовРасчета.инкНачисления.ВыходноеПособие.Код);
		ПереченьКодов.Добавить(ПланыВидовРасчета.инкНачисления.ОплатаДопВыходныхДляУходаЗаДетьмиИнвалидами.Код);
	КонецЕсли;
	
	Возврат ПереченьКодов;
	
КонецФункции                                        

&НаКлиенте
Процедура ПерезаполнитьНачисления(Команда)    
	
	ВопросПерезаполнитьНачисления();
  
КонецПроцедуры   

&НаКлиенте
Процедура ВидРасчетаДниЧасыПриИзменении(Элемент)

	ВопросПерезаполнитьНачисления();

КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезаполнитьНачисления()
	
	ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть ""Расчетные данные"" будет очищена. Заполнить?'");
	Оповещение = Новый ОписаниеОповещения("ВопросПерезаполнитьНачисленияЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВидРасчетаОтпускаПриИзменении(Элемент)

	ВопросПерезаполнитьНачисления();

КонецПроцедуры                         

&НаСервере
Процедура ВидРасчетаОтпускаПриИзмененииНаСервере()
	
	ВидимостьВидаРасчетаДниЧасы = Ложь;
	Если Объект.ВидРасчета = Перечисления.инкВидРасчетаОтпуска.ПоСреднему Тогда
		ВидимостьВидаРасчетаДниЧасы = Истина;	                  
		Объект.ВидНачисления = ПланыВидовРасчета.инкНачисления.ОплатаПоСреднемуЗаработку;
	Иначе
		Объект.ВидНачисления = ПланыВидовРасчета.инкНачисления.ОплатаОчередныхОтпусков;
	КонецЕсли;	                            
	
	Элементы.ВидРасчетаДниЧасы.Видимость = ВидимостьВидаРасчетаДниЧасы;
	
КонецПроцедуры                                  

&НаКлиенте
Процедура ВопросПерезаполнитьНачисленияЗавершение(Результат, ДополнительныеДанные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВидРасчетаОтпускаПриИзмененииНаСервере();	
		ЗаполнитьРасчетныеДанныеНаСервере(Истина);	
	КонецЕсли;                                      	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеДанныеПриИзменении(Элемент)            
	
	РасчетныеДанныеИтогиНаСервере();
	
КонецПроцедуры                             

&НаКлиенте
Процедура ОсновнойОтпускДниПриИзменении(Элемент)

	РасчитатьДополнительныйОтпускДни();
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьДополнительныйОтпускДни()

	Объект.ДополнительныйОтпускДни = Объект.Дней - Объект.ОсновнойОтпускДни;
	Если Объект.ДополнительныйОтпускДни < 0 Тогда
		Объект.ДополнительныйОтпускДни = 0;
	КонецЕсли; 
	
	РасчитатьОтпускНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РасчетныеДанныеПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура КомпенсацияЗаНеиспользованныйОтпускПриИзмененииНаСервере()
	
	Если Объект.КомпенсацияЗаНеиспользованныйОтпускДни <> 0 Тогда
		Объект.ВидНачисления = ПланыВидовРасчета.инкНачисления.КомпенсацияЗаНеиспользованныйОтпуск;
	Иначе
		Если Объект.ВидНачисления = ПланыВидовРасчета.инкНачисления.КомпенсацияЗаНеиспользованныйОтпуск Тогда
			Объект.ВидНачисления = ПланыВидовРасчета.инкНачисления.ОплатаОчередныхОтпусков;		
		КонецЕсли;
	КонецЕсли;

	РасчитатьОтпускНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомпенсацияЗаНеиспользованныйОтпускПриИзменении(Элемент)   
	
	КомпенсацияЗаНеиспользованныйОтпускПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВидОтпускаПриИзменении(Элемент) 
	
	РасчитатьОтпускНаСервере();	

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	РасчитатьОтпускНаСервере();

КонецПроцедуры

#КонецОбласти	                        

#Область о // Месяц начисления:

&НаКлиенте
Процедура мМесяцНачисленияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Элемент",Элемент);
	
    ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.МесяцНачисления), КонецМесяца(Объект.МесяцНачисления));
	ОписаниеОповещения     = Новый ОписаниеОповещения("МесяцНачисленияСтрокойНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.инкВыборСтандартногоПериодаМесяц", ПараметрыВыбораПериода, Объект.МесяцНачисления, , , , ОписаниеОповещения);

КонецПроцедуры  

&НаКлиенте
Процедура МесяцНачисленияСтрокойНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
    
	Объект.МесяцНачисления = РезультатВыбора.НачалоПериода;
    инкЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.МесяцНачисления", "мМесяцНачисленияСтрокой", 0, Модифицированность);

КонецПроцедуры    

#КонецОбласти

#Область о // Дополнительные процедуры и функции:

&НаСервере                                       
Процедура ЗаполнитьДниОтпуска()
	
	ДниОтпускаСтруктура = РасчитатьДниОтпускаНаСервере(Объект.ПериодС,Объект.ПериодПО);
	
	Если НЕ ЗначениеЗаполнено(Объект.Дней) Тогда
		Объект.Дней	= ДниОтпускаСтруктура.Дней;	
	КонецЕсли;      
	
	Если НЕ ЗначениеЗаполнено(Объект.РабочихДней) Тогда
		Объект.РабочихДней = ДниОтпускаСтруктура.РабочихДней;		
	КонецЕсли;      
	
	Если НЕ ЗначениеЗаполнено(Объект.ОсновнойОтпускДни) Тогда
		Объект.ОсновнойОтпускДни = ДниОтпускаСтруктура.Дней;		
	КонецЕсли;      
	
	РасчитатьДополнительныйОтпускДни();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчитатьДниОтпускаНаСервере(Дата1,Дата2)
	
	ДниОтпускаСтруктура = Новый Структура;
	ДниОтпускаСтруктура.Вставить("Дней",0);
	ДниОтпускаСтруктура.Вставить("РабочихДней",0);
	
	ПроизводственныйКалендарьТаблица = инкУчетВремениСервер.ПолучитьДанныеПроизводственногоКалендаряЗаПериод(Дата1,Дата2);
	Если ПроизводственныйКалендарьТаблица.Количество() > 0 Тогда
		
		Для каждого ПроизводственныйКалендарьСтрока Из ПроизводственныйКалендарьТаблица Цикл
			
			Если ПроизводственныйКалендарьСтрока.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
				ДниОтпускаСтруктура.РабочихДней = ДниОтпускаСтруктура.РабочихДней + 1;	
			КонецЕсли;
			ДниОтпускаСтруктура.Дней = ДниОтпускаСтруктура.Дней + 1;
			
		КонецЦикла;
		
	Иначе	
		
		КоличествоДней = (Дата2 - Дата1) / 86400;
		Для Сч = 0 По КоличествоДней Цикл
			
			ДатаВЦикле = Дата1 + 86400 * Сч;
			Если ДеньНедели(ДатаВЦикле) <= 5 Тогда
				ДниОтпускаСтруктура.РабочихДней = ДниОтпускаСтруктура.РабочихДней + 1;
			КонецЕсли;
			ДниОтпускаСтруктура.Дней = ДниОтпускаСтруктура.Дней + 1;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ДниОтпускаСтруктура;
	
КонецФункции

&НаКлиенте
Процедура РасчитатьКоличествоДней()
	
	//Если Не ЗначениеЗаполнено(Объект.БольничныйДатаОкончания) Тогда
	//	Объект.БольничныйДатаОкончания = Объект.БольничныйДатаНачала;
	//КонецЕсли;
	//Объект.КоличествоДней = (НачалоДня(Объект.БольничныйДатаОкончания) - НачалоДня(Объект.БольничныйДатаНачала)) / (60 * 60 * 24) + 1;
	
КонецПроцедуры
                                   
&НаСервере
Процедура ЗаполнитьРеквизит(ИмяСвойства,Значение)
	
	Если ЗначениеЗаполнено(Объект[ИмяСвойства]) Тогда
		Возврат;	
	КонецЕсли;	

	Объект[ИмяСвойства] = Значение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитИзПараметров(ИмяСвойства,Параметры)
	
	Если Параметры.Свойство(ИмяСвойства) Тогда
		ЗаполнитьРеквизит(ИмяСвойства,Параметры[ИмяСвойства]);    
		мПомещатьРасчетВХранилище = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	
	ВозвращаемыеСведения = Новый Структура;             
	ВозвращаемыеСведения.Вставить("Сотрудник", Объект.Сотрудник); 
	ВозвращаемыеСведения.Вставить("тзПрочиеНачисления",Неопределено);
	ВозвращаемыеСведения.Вставить("ДокументСсылка", Неопределено); 
	
	Если Объект.Проведен Тогда
		ВозвращаемыеСведения.тзПрочиеНачисления = Объект.РезультатРасчета.Выгрузить();	
		ВозвращаемыеСведения.Вставить("ДокументСсылка", Объект.Ссылка); 
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьКолонокПриСменеВидаРасчета()

	ВидимостьДниБулево = Истина;
	
	Элементы.РасчетныеДанныеДни.Видимость = ВидимостьДниБулево;
	Элементы.РасчетныеДанныеДниФакт.Видимость = ВидимостьДниБулево;
	
КонецПроцедуры

#КонецОбласти	                        

#Область о // Исходные данные:

&НаСервере
Функция ПолучитьИсходныеДанные()
	
	ИсходныеДанные = Новый Структура;   
	ИсходныеДанные.Вставить("РасчетныеДанные",Объект.РасчетныеДанные.Выгрузить());   
	ИсходныеДанные.Вставить("ВидРасчета",Объект.ВидРасчета);   
	ИсходныеДанные.Вставить("МесяцНачисления",Объект.МесяцНачисления);
	ИсходныеДанные.Вставить("Дата2",НачалоМесяца(Объект.МесяцНачисления)-1);
	ИсходныеДанные.Вставить("Дата1",НачалоМесяца(ДобавитьМесяц(ИсходныеДанные.Дата2,-11)));
	ИсходныеДанные.Вставить("Сотрудник",Объект.Сотрудник);
	ИсходныеДанные.Вставить("НачисленияТаблица",ПолучитьНачисления(ИсходныеДанные));
	ИсходныеДанные.Вставить("ВедомостьТаблица",инкУчетВремениСервер.ПолучитьНормуВремениИзВедомости(ИсходныеДанные));
	ИсходныеДанные.Вставить("ТабельТаблица",инкУчетВремениСервер.ПолучитьТабельТаблица(ИсходныеДанные));
	ИсходныеДанные.Вставить("НормаВремениТаблица",инкУчетВремениСервер.ПолучитьНормаВремениТаблица(ИсходныеДанные));
	  
	Возврат ИсходныеДанные;	
	
КонецФункции    

&НаСервере
Функция ПолучитьНачисления(ИсходныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкНачисленияОбороты.Период КАК Месяц,
		|	инкНачисленияОбороты.Начисление КАК Начисление,
		|	инкНачисленияОбороты.Начисление.Премия КАК ВидПремии,
		|	инкНачисленияОбороты.Сотрудник КАК Сотрудник,
		|	инкНачисленияОбороты.СуммаНачисленияОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.инкНачисления.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Месяц,
		|			Сотрудник = &Сотрудник
		|				И Отпуск) КАК инкНачисленияОбороты";
	
	                                                      
	Запрос.УстановитьПараметр("Дата1", ИсходныеДанные.Дата1);
	Запрос.УстановитьПараметр("Дата2", ИсходныеДанные.Дата2);
	Запрос.УстановитьПараметр("Сотрудник", ИсходныеДанные.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;	
	
КонецФункции

#КонецОбласти

#Область о // Заполнение расчетных данных:

&НаСервере
Процедура ЗаполнитьРасчетныеДанныеНаСервере(Перезаполнение = Ложь)
	
	Если Перезаполнение Тогда
		Объект.РасчетныеДанные.Очистить();		
	КонецЕсли;
	
	Если Объект.РасчетныеДанные.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;	

	ИсходныеДанные = ПолучитьИсходныеДанные();
	
	Объект.РасчетныеДанные.Очистить();
	ТекущийМесяцДата = ИсходныеДанные.Дата1;
	Для МесяцНомер = 1 По 12 Цикл

		РасчетныеДанныеЗаПериод = ПолучитьРасчетныеДанныеЗаПериод(ТекущийМесяцДата,ИсходныеДанные);
		РасчетныеДанныеСтрока = Объект.РасчетныеДанные.Добавить();
		
		ЗаполнитьЗначенияСвойств(РасчетныеДанныеСтрока,РасчетныеДанныеЗаПериод);
		
		ТекущийМесяцДата = ДобавитьМесяц(ТекущийМесяцДата,1);	
		
	КонецЦикла;
	
	РасчетныеДанныеИтогиНаСервере();  
	                                  
КонецПроцедуры                   

&НаСервере
Функция ПолучитьРасчетныеДанныеЗаПериод(ТекущийМесяцДата,ИсходныеДанные)

	РасчетныеДанныеСтруктура = Новый Структура;	    
	Для каждого КолонкаТаблицы Из ИсходныеДанные.РасчетныеДанные.Колонки Цикл
		РасчетныеДанныеСтруктура.Вставить(КолонкаТаблицы.Имя);	
	КонецЦикла;               	                              
	РасчетныеДанныеСтруктура.Год   = НачалоГода(ТекущийМесяцДата);
	РасчетныеДанныеСтруктура.Месяц = ТекущийМесяцДата;
	
	КоличествоДнейЧасовПоПериоду 			= ПолучитьКоличествоДнейЧасовПоПериоду(ТекущийМесяцДата,ИсходныеДанные);
	РасчетныеДанныеСтруктура.ДниЧасы     	= КоличествоДнейЧасовПоПериоду.ДниЧасы;         
	РасчетныеДанныеСтруктура.ДниЧасыФакт 	= КоличествоДнейЧасовПоПериоду.ДниЧасыФакт;
	
	СуммыПоПериоду = ПолучитьПремииПоИтогамРаботы(ТекущийМесяцДата,ИсходныеДанные);
	РасчетныеДанныеСтруктура.ПремииМесяц	= СуммыПоПериоду.ПремииМесяц;
	РасчетныеДанныеСтруктура.ПремииКвартал  = СуммыПоПериоду.ПремииКвартал;
	РасчетныеДанныеСтруктура.ПремииГод      = СуммыПоПериоду.ПремииГод;
	РасчетныеДанныеСтруктура.Зарплата 		= СуммыПоПериоду.Зарплата;  
	                                            
	Возврат РасчетныеДанныеСтруктура;                         
	
КонецФункции 

&НаСервере
Функция ПолучитьЗарплатуПоПериоду(ТекущийМесяцДата,ИсходныеДанные)
	
	ЗаралатаСумма = 0;
	
	Возврат ЗаралатаСумма;
	
КонецФункции
                                                                
&НаСервере
Функция ПолучитьПремииПоИтогамРаботы(ТекущийМесяцДата,ИсходныеДанные)
	
	ПремииСтруктура = Новый Структура;
	ПремииСтруктура.Вставить("ПремииМесяц",0);
	ПремииСтруктура.Вставить("ПремииКвартал",0);
	ПремииСтруктура.Вставить("ПремииГод",0);
	ПремииСтруктура.Вставить("Зарплата",0);
	
	ПериодПоиск = Новый Структура;
	ПериодПоиск.Вставить("Месяц",ТекущийМесяцДата);
	
	НачисленияМассив = ИсходныеДанные.НачисленияТаблица.НайтиСтроки(ПериодПоиск);
	
	Для каждого НачислениеЭлемент Из НачисленияМассив Цикл
		
		ПремияСтрока = "";
		Если НачислениеЭлемент.ВидПремии = Перечисления.инкВидыПремий.Годовая Тогда
			ПремияСтрока = "ПремииГод";
		ИначеЕсли НачислениеЭлемент.ВидПремии = Перечисления.инкВидыПремий.Квартальная Тогда
			ПремияСтрока = "ПремииКвартал";
		ИначеЕсли НачислениеЭлемент.ВидПремии = Перечисления.инкВидыПремий.Месяц Тогда
			ПремияСтрока = "ПремииМесяц";	
		Иначе
			ПремияСтрока = "Зарплата";
		КонецЕсли;  
		
		Если ПремияСтрока <> "" Тогда
			ПремииСтруктура[ПремияСтрока] = ПремииСтруктура[ПремияСтрока] + НачислениеЭлемент.Сумма;	
		КонецЕсли;
		
	КонецЦикла;  
	
	Возврат ПремииСтруктура;	
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДнейЧасовПоПериоду(ТекущийМесяцДата,ИсходныеДанные);
	
	КоличествоДнейЧасов = Новый Структура;
	КоличествоДнейЧасов.Вставить("ДниЧасы",0);
	КоличествоДнейЧасов.Вставить("ДниЧасыФакт",0);
	
	ПоискПериода = Новый Структура;
	ПоискПериода.Вставить("Месяц",ТекущийМесяцДата);  
	
	НормаВремениМассив  = ИсходныеДанные.НормаВремениТаблица.НайтиСтроки(ПоискПериода);
	ВедомостьМассив 	= ИсходныеДанные.ВедомостьТаблица.НайтиСтроки(ПоискПериода);
	
	Если ИсходныеДанные.ВидРасчета = Перечисления.инкВидРасчетаОтпуска.Отпуск Тогда
		
		// Поиск данных по ведомости:
		Для каждого ВедомостьСтрока Из ВедомостьМассив Цикл
			Если Объект.ВидРасчетаДниЧасы = Перечисления.инкВидРасчетаДниЧасы.ВДнях Тогда
				КоличествоДнейЧасов.ДниЧасы = ВедомостьСтрока.Дни;
				КоличествоДнейЧасов.ДниЧасыФакт = ВедомостьСтрока.ДниФакт;
			КонецЕсли;
		КонецЦикла;              			

		Если КоличествоДнейЧасов.ДниЧасы = 0 Тогда
			Для каждого НормаВремениЭлемент Из НормаВремениМассив Цикл 
            	КоличествоДнейЧасов.ДниЧасы = НормаВремениЭлемент.КалендраныхДней;	
			КонецЦикла;      
		КонецЕсли;
		
	Иначе
		                  
 		// Поиск данных по ведомости:
		Для каждого ВедомостьСтрока Из ВедомостьМассив Цикл
			
			Если Объект.ВидРасчетаДниЧасы = Перечисления.инкВидРасчетаДниЧасы.ВДнях Тогда
				КоличествоДнейЧасов.ДниЧасы = ВедомостьСтрока.НормаДни;
				КоличествоДнейЧасов.ДниЧасыФакт = ВедомостьСтрока.НормаДниФакт;
			Иначе
				КоличествоДнейЧасов.ДниЧасы = ВедомостьСтрока.НормаЧасы;
				КоличествоДнейЧасов.ДниЧасыФакт = ВедомостьСтрока.НормаЧасыФакт;
			КонецЕсли;
		КонецЦикла;  
		
		Если КоличествоДнейЧасов.ДниЧасы = 0 Тогда
			Для каждого НормаВремениЭлемент Из НормаВремениМассив Цикл    
				Если Объект.ВидРасчетаДниЧасы = Перечисления.инкВидРасчетаДниЧасы.ВДнях Тогда
                	КоличествоДнейЧасов.ДниЧасы = НормаВремениЭлемент.РабочихДнейВМесяце;		
				Иначе
					КоличествоДнейЧасов.ДниЧасы = НормаВремениЭлемент.НормаЧасовМужчиныПятидневка;
				КонецЕсли; 				
			КонецЦикла;      
		КонецЕсли;

	КонецЕсли;
	
	Возврат КоличествоДнейЧасов;
	
КонецФункции       

&НаСервере
Процедура РасчетныеДанныеИтогиНаСервере()
	
	РасчетныеДанные = Объект.РасчетныеДанные;
	
	Для каждого РасчетныеДанныеСтрока Из РасчетныеДанные Цикл
		
		РасчетныеДанныеСтрока.Итого = РасчетныеДанныеСтрока.ПремииМесяц
					+ РасчетныеДанныеСтрока.ПремииКвартал
					+ РасчетныеДанныеСтрока.ПремииГод
					+ РасчетныеДанныеСтрока.Зарплата;

		Если РасчетныеДанныеСтрока.ДниЧасы <> РасчетныеДанныеСтрока.ДниЧасыФакт Тогда
			РасчетныеДанныеСтрока.КорректировкаДни = РасчетныеДанныеСтрока.ДниЧасыФакт;
		Иначе
		    РасчетныеДанныеСтрока.КорректировкаДни = 29.3;
		КонецЕсли;	       
		
		Если (РасчетныеДанныеСтрока.ДниЧасы = 0) ИЛИ (РасчетныеДанныеСтрока.ДниЧасыФакт = 0) Тогда
			РасчетныеДанныеСтрока.КорректировкаДни	= 0;							      
		КонецЕсли;                                       
        	
		Если РасчетныеДанныеСтрока.ДниЧасы <> 0 Тогда
			РасчетныеДанныеСтрока.КорректировкаДниРасчет = 29.3 * РасчетныеДанныеСтрока.ДниЧасыФакт 
			                                             / РасчетныеДанныеСтрока.ДниЧасы;		
		Иначе		
			РасчетныеДанныеСтрока.КорректировкаДниРасчет = 0;
		КонецЕсли;
			
		Если РасчетныеДанныеСтрока.ПовышениеЗПСуммаИндексации = 0 Тогда
			
			РасчетныеДанныеСтрока.ПовышениеЗПСуммаИндексации = РасчетныеДанныеСтрока.Итого
			                                                 * РасчетныеДанныеСтрока.ПовышениеЗПКоэффициент;
			
		КонецЕсли;
		
		// Тогда колонка итого, должна распологаться в крайнем левом положении:
		//РасчетныеДанныеСтрока.Итого = РасчетныеДанныеСтрока.Итого + РасчетныеДанныеСтрока.ПовышениеЗПСуммаИндексации;
		
	КонецЦикла; 
	
	РасчитатьОтпускНаСервере();
	
КонецПроцедуры

#КонецОбласти	                        

#Область о // Расчет отпускных:

&НаСервере
Процедура РасчитатьОтпускНаСервере()
	
	//
	РасчетСтруктура = ПолучитьРасчетСтруктура();
	//           
	ПояснениеРасчета = "Расчет на "+ТекущаяДата()+": "+Символы.ПС;
	//
	ПояснениеРасчета = ПояснениеРасчета + Объект.Сотрудник.ФИОСокращенное + ", "
	                 + "Организация - " + Объект.Организация + ", "
					 + "Подразделение - " + Объект.Подразделение + ". "
					 + "Расчет отпуска."
					 + Символы.ПС
					 + Символы.ПС;

	СтрокаРасчетнаяСуммаЗарплаты = Формат(РасчетСтруктура.РасчетнаяСуммаЗарплаты,"ЧДЦ=2; ЧН=0,00");
	Если РасчетСтруктура.СуммаИндексации <> 0 Тогда
		СтрокаРасчетнаяСуммаЗарплаты = "("
							 + СтрокаРасчетнаяСуммаЗарплаты
		                     + " + "
							 + Формат(РасчетСтруктура.СуммаИндексации,"ЧДЦ=2; ЧН=0,00")
							 + ")"
							 + " = "
							 + Формат(РасчетСтруктура.РасчетнаяСуммаЗарплаты+РасчетСтруктура.СуммаИндексации,"ЧДЦ=2; ЧН=0,00");	
	КонецЕсли;

	ПояснениеРасчета = ПояснениеРасчета 
					 + "Расчетная сумма зарплаты: "
					 + СтрокаРасчетнаяСуммаЗарплаты
					 + Символы.ПС;
					 
					 
	ПояснениеРасчета = ПояснениеРасчета 
					 + "Расчёт среднего дневного заработка: " 
					 + Формат(РасчетСтруктура.РасчетнаяСуммаЗарплаты+РасчетСтруктура.СуммаИндексации,"ЧДЦ=2; ЧН=0,00") 
					 + " / "
					 + Формат(РасчетСтруктура.ДниКоличество,"ЧДЦ=2; ЧН=0,00")
					 + " = "
					 + Формат(РасчетСтруктура.РасчетнаяСумма,"ЧДЦ=2; ЧН=0,00")
					 + Символы.ПС
					 + Символы.ПС;
					 
	Если РасчетСтруктура.НеиспОтпускДни = 0 Тогда
		
		СтрокаРасчетаДополнительныйОтпуск = "";
		Если РасчетСтруктура.ДниДополнительныйОтпуск Тогда
			СтрокаРасчетаДополнительныйОтпуск = " + "
			                                  + Формат(РасчетСтруктура.РасчетнаяСумма,"ЧДЦ=2; ЧН=0,00")
			                                  + " * " 
			                                  + РасчетСтруктура.ДниДополнительныйОтпуск;   	
		КонецЕсли;

		ПояснениеРасчета = ПояснениеРасчета 
						 + "Итого начислено: "
						 + Формат(РасчетСтруктура.РасчетнаяСумма,"ЧДЦ=2; ЧН=0,00")
						 + " * "
						 + РасчетСтруктура.ДниОтпуск
						 + СтрокаРасчетаДополнительныйОтпуск
						 + " = "
						 + РасчетСтруктура.ИтогоНачисленоСумма					 
						 + Символы.ПС;  
						 
	Иначе					

		ПояснениеРасчета = ПояснениеРасчета 
						 + "Итого начислено: "
						 + Формат(РасчетСтруктура.РасчетнаяСумма,"ЧДЦ=2; ЧН=0,00")
						 + " * "
						 + РасчетСтруктура.НеиспОтпускДни
						 + " = "
						 + РасчетСтруктура.ИтогоНачисленоСумма					 
						 + Символы.ПС;  
		
	КонецЕсли;				 
					 
	//                  
	Объект.ПояснениеРасчета = ПояснениеРасчета; 
	//
	ЗаполнитьРезультатРасчета(РасчетСтруктура);
                               	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРезультатРасчета(РасчетСтруктура)
	
	Объект.РезультатРасчета.Очистить();
	
	// За счет работодателя:
	НачислениеСтрока = Объект.РезультатРасчета.Добавить();
	НачислениеСтрока.Начисление = Объект.ВидНачисления;
	//
	НачислениеСтрока.СуммаНачисления = РасчетСтруктура.ИтогоНачисленоСумма;	
    //
	НачислениеСтрока.Дни             = РасчетСтруктура.ДниОтпуск;
	НачислениеСтрока.Месяц           = РасчетСтруктура.МесяцОтпуск;
	
	Объект.СуммаДокумента = Объект.РезультатРасчета.Итог("СуммаНачисления");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасчетСтруктура()
	
	РасчетСтруктура = Новый Структура;
	РасчетСтруктура.Вставить("ДниОтпуск",Объект.ОсновнойОтпускДни);
	РасчетСтруктура.Вставить("ДниДополнительныйОтпуск",Объект.ДополнительныйОтпускДни);
	РасчетСтруктура.Вставить("МесяцОтпуск",Объект.МесяцНачисления);
	РасчетСтруктура.Вставить("РасчетнаяСуммаЗарплаты",0);
	РасчетСтруктура.Вставить("ДниКоличество",0);
	РасчетСтруктура.Вставить("РасчетнаяСумма",0);
	РасчетСтруктура.Вставить("ИтогоНачисленоСумма",0);     
	РасчетСтруктура.Вставить("НеиспОтпускДни",Объект.КомпенсацияЗаНеиспользованныйОтпускДни);     
	РасчетСтруктура.Вставить("СуммаИндексации",0);     

	РасчетСтруктура.СуммаИндексации = Объект.РасчетныеДанные.Итог("ПовышениеЗПСуммаИндексации");     
	
	РасчетСтруктура.РасчетнаяСуммаЗарплаты	= Объект.РасчетныеДанные.Итог("Итого");
											
	Если Объект.ВидРасчета = Перечисления.инкВидРасчетаОтпуска.ПоСреднему Тогда
		РасчетСтруктура.ДниКоличество			= Объект.РасчетныеДанные.Итог("ДниЧасыФакт");	
	Иначе
		РасчетСтруктура.ДниКоличество			= Объект.РасчетныеДанные.Итог("КорректировкаДниРасчет");	
	КонецЕсли;
	
	//                                                                               
	Если РасчетСтруктура.ДниКоличество <> 0 Тогда
		РасчетСтруктура.РасчетнаяСумма = Окр(РасчетСтруктура.РасчетнаяСуммаЗарплаты / РасчетСтруктура.ДниКоличество,2);	
	КонецЕсли;
	//                             
	Если РасчетСтруктура.НеиспОтпускДни = 0 Тогда
		РасчетСтруктура.ИтогоНачисленоСумма = Окр(РасчетСтруктура.ДниОтпуск * (РасчетСтруктура.РасчетнаяСумма + РасчетСтруктура.СуммаИндексации),2)
		                                    + Окр(РасчетСтруктура.ДниДополнительныйОтпуск * (РасчетСтруктура.РасчетнаяСумма + РасчетСтруктура.СуммаИндексации),2);
	Иначе
		РасчетСтруктура.ИтогоНачисленоСумма = Окр(РасчетСтруктура.НеиспОтпускДни * (РасчетСтруктура.РасчетнаяСумма + РасчетСтруктура.СуммаИндексации),2);
	КонецЕсли;
	
	Возврат РасчетСтруктура;
	                                                 
КонецФункции                  

&НаКлиенте
Процедура РасчетныеДанныеПовышениеЗПКоэффициентПриИзменении(Элемент)        
	
	ТекущиеДанные = Элементы.РасчетныеДанные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;            
	
	Если ТекущиеДанные.ПовышениеЗПКоэффициент = 0 Тогда
		ТекущиеДанные.ПовышениеЗПСуммаИндексации = 0;
		Возврат;	
	КонецЕсли;         
	
	ПараметрыСтруктура = Новый Структура;
	ПараметрыСтруктура.Вставить("Месяц");     
	ПараметрыСтруктура.Вставить("ПовышениеЗПКоэффициент");
	ЗаполнитьЗначенияСвойств(ПараметрыСтруктура,ТекущиеДанные);
	
	ТекстВопроса = НСтр("ru = 'Заполнить значения коэффициента прошлых периодов?'");
	Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьЗначениеКоэффициентовЗавершение", ЭтотОбъект, ПараметрыСтруктура);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
                                          
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьЗначениеКоэффициентовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	РасчетныеДанныеПовышениеЗПКоэффициентПриИзмененииНаСервере(ДополнительныеПараметры.Месяц,ДополнительныеПараметры.ПовышениеЗПКоэффициент);    
	КонецЕсли;    
	
	РасчетныеДанныеИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РасчетныеДанныеПовышениеЗПКоэффициентПриИзмененииНаСервере(Месяц,ПовышениеЗПКоэффициент)
	
	Для каждого РасчетныеДанныеСтрока Из Объект.РасчетныеДанные Цикл
		
		Если РасчетныеДанныеСтрока.Месяц < Месяц Тогда

			Если Не ЗначениеЗаполнено(РасчетныеДанныеСтрока.ПовышениеЗПКоэффициент) Тогда
				РасчетныеДанныеСтрока.ПовышениеЗПКоэффициент = ПовышениеЗПКоэффициент;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
